import React from "react";
import { Link } from "react-router-dom";

function Intro() {
  return (
    <div className="flex flex-col justify-between min-h-screen">
      <div className="p-6 max-w-prose mx-auto text-right text-gray-800">
        <h2 className="text-2xl font-semibold mb-4 underline">: المقدمة</h2>
        <p className="mb-4 leading-relaxed">
          آلة الناي من أقدم الآلات الموسيقية ، وبداية ظهورها يرجع إلى ما قبل
          الحضارات الإغريقية والرومانية ، وأول اكتشاف للإنسان البدائي آلات الطرق
          ثم آلات النفخ ومنها ما هو مصنوع من نبات الغاب ومنها ما هو من قرون
          الحيوانات وانتشرت هذه الآلات عبر العصور عن طريق الحروب والتبادلات
          التجارية ، واستمرت آلة الناي تتعاقب عبر العصور بأشكال مختلفة منها ما
          هو ذو ثقبين أو ثلاث أو أربع ثقوب حتى وصلت إلى ما هو عليه الآن ستة ثقوب
          أمامية وثقب واحد من الخلف. هذا التطبيق لتعلم آلة الناي ، ان هذه
          الطريقة التعليمية هي عبارة عن مجموعه من الدروس مصممة خصيصاً لتعلم آلة
          الناي بطريقة صحيحة واكاديمية مع الكثير من الامثلة والتمارين سنستعمل
          عدة وسائل تعليمية في هذا التطبيق من فيديو وصورة وصوت وبرامج مصممة
          خصيصاً للمساعدة في تعلم آلة الناي.
        </p>
        <p className="mb-4 leading-relaxed">
          <h2 className="text-2xl font-semibold mb-4 underline">
            : معلومات عن آلة الناي
          </h2>
          آلة الناي عباره عن قصبة جوفاء مأخوذه من نبات الغاب مفتوحة الطرفين
          تتكون من تسعة عقل وتحتوي علي ستة ثقوب امامية وثقب واحد في الخلف وكل
          ثقب يبعد عن الاخر بعداً معياناً والبعد بين الثقب والثقب والذي يليه
          متفاوت وذلك حسب ابعاد المسافات الصوتية وتوضع اصابع اليدين علي هذه
          الثقوب باحكام لغلقها وعند النفخ يرفع العازف الاصبع الذي يريده ليصدر من
          الآلة الصوت المطلوب ويتم غلق الثقوب الامامية باصابع البنصر والوسطي
          والسبابة لليد اليمني ويتم غلق الثقوب الثلاثة السفلي باصبح البنصر
          والوسطي والسبابة لليد اليسري ويغلق الثقب الخلفي باصبع الابهام لليد
          اليسري.
        </p>
      </div>

      <div className="text-end p-4 my-3 text-3xl  font-bold">
        <Link
          className="shadow-lg bg-slate-500 hover:bg-slate-600  focus:ring-2  px-6 py-3 rounded-lg text-white transition duration-200 ease-in-out"
          to={"/afterintro"}
        >
          التالي
        </Link>
      </div>
    </div>
  );
}

export default Intro;
